# SketchedStairsCurveData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SketchedStairsCurveData Properties
SketchedStairsCurveData Class See Also
---
The SketchedStairsCurveData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace